app/Controllers/HubController.php

SELECT *
FROM `data_sla`
---
    public function export()
    {
        // Assuming SLA is your model for interacting with the database
        $model = new SLA();

        // Retrieve data from database
        $data = $model->findAll();