app/Controllers/UserController.php

SELECT *
FROM `role`
SELECT *
FROM `role`
WHERE `role`.`id` = '2'
---
    public function index()
    {
        $userModel = new UserModel();
        $roleModel = new RoleModel();

        // Fetch all roles
        $data['roles'] = $roleModel->findAll();

        // Fetch all users
        $users = $userModel->findAll();

        // Associate roles with users
        foreach ($users as &$user) {
            $role = $roleModel->find($user['role']);