app/Models/SLA.php

    public function getAllData()
    {
        return $this->findAll();
---
SELECT *
FROM `data_sla`