app/Models/SLA.php

SELECT *
FROM `data_sla`
ORDER BY `create_at` DESC
---
    public function getAllData()
    {
        return $this->orderBy('create_at', 'DESC')->findAll();

INSERT INTO `data_sla` (`platform`, `id`, `tanggal_instalasi`, `hub_status`, `ttr`, `av_percentage`) VALUES ('RIOT', 'NEON', 2024, 'ACTIVE', 0, 100)
---
    public function insertDataSla($data)
    {
        $data['av_percentage'] = $this->calculateAvPercentage($data['ttr'], $data['tanggal_instalasi']);
        return $this->insert($data);